-- phpMyAdmin SQL Dump
-- version 4.9.0.1
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3306
-- Время создания: Июл 20 2020 г., 11:43
-- Версия сервера: 10.3.13-MariaDB-log
-- Версия PHP: 7.1.32

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `базаданных`
--

-- --------------------------------------------------------

--
-- Структура таблицы `table1`
--

CREATE TABLE `table1` (
  `Код` int(2) UNSIGNED NOT NULL,
  `Пользователь` varchar(16) DEFAULT NULL,
  `Пароль` varchar(8) DEFAULT NULL,
  `ФИО` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `table1`
--

INSERT INTO `table1` (`Код`, `Пользователь`, `Пароль`, `ФИО`) VALUES
(7, 'ddff', '34617069', 'Воробьёв С.Л.'),
(56, 'log', 'pas', 'Жуков А.И.'),
(63, 'er', '55979220', 'Рыбакоа Л.С.'),
(64, 'vb', '47818589', 'Зыков А.Ф.'),
(71, 'Testtet', '12686542', 'Тимофеев Л.В.'),
(73, 'Teslo', '83977697', ''),
(74, 'log', 'pas1234', 'Кудрявцев И.Л.'),
(75, 'log', 'pas2935', 'Аксёнов П.А.'),
(76, 'log', 'pas2952', 'Елисеев А.П.'),
(77, 'log', 'pas5957', 'Константинов А.В.'),
(78, 'log', 'pas1257', 'Кириллов П.В.'),
(79, 'log', 'pas1258', 'Бобылёв Ф.П.'),
(80, 'log', 'pas2955', 'Устинов Д.Р.'),
(81, 'log', 'pas3512', 'Елисеев Р.С.'),
(82, 'log', 'pas3625', 'Кудрявцев М.Р.'),
(83, 'log', 'pas7025', 'Воробьёв Д.А.');

-- --------------------------------------------------------

--
-- Структура таблицы `table2`
--

CREATE TABLE `table2` (
  `id` int(10) NOT NULL,
  `Название_организации` varchar(98) DEFAULT NULL,
  `Контактная_информация` varchar(50) DEFAULT NULL,
  `ФИО_заказчика` varchar(50) DEFAULT NULL,
  `Дата` varchar(50) DEFAULT NULL,
  `Количество` int(50) DEFAULT NULL,
  `Вид_литья` varchar(50) DEFAULT NULL,
  `Деталь` varchar(50) DEFAULT NULL,
  `Статус` varchar(50) DEFAULT NULL,
  `Дата_сдачи` varchar(50) DEFAULT NULL,
  `Цена` varchar(50) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `table2`
--

INSERT INTO `table2` (`id`, `Название_организации`, `Контактная_информация`, `ФИО_заказчика`, `Дата`, `Количество`, `Вид_литья`, `Деталь`, `Статус`, `Дата_сдачи`, `Цена`) VALUES
(43, 'ООО \"NanoRus\"', 'Nanorus@mail.ru', 'Басов В.Р.', '11.01.2018', 8, 'Художественное_литье', 'Скамейки', 'Выполнен', '21.01.2018', NULL),
(60, 'ООО \"ТEST\"', 'TESTS@mail.ru', 'Архипов В.А.', '25.09.2018', 233, 'Художественное_литье', 'Скамейки', 'Отменен', '00.00.0000', NULL),
(76, 'ООО \"RusAUTO\"', 'RUsAUT@mail.ru', 'Воробушкин Р.В.', '11.02.2020', 2, 'Стальное_литье', 'Отбойники', 'Новый', '00.00.0000', NULL),
(77, 'ООО \"RusAUTO\"', 'RUsAUT@mail.ru', 'Воробушкин Р.В.', '11.02.2020', 2, 'Стальное_литье', 'Отбойники', 'Новый', '00.00.0000', '25000'),
(78, 'ООО \"RusAUTO\"', 'RUsAUT@mail.ru', 'Воробушкин Р.В.', '11.02.2020', 2, 'Стальное_литье', 'Отбойники', 'Процесс', '00.00.0000', '32000'),
(83, 'ООО \"RusAUTO\"', 'RUsAUT@mail.ru', 'Воробушкин Р.В.', '13.05.2020', 22, 'Стальное_литье', 'Отбойники', 'Новый', '00.00.0000', 'None'),
(86, 'ООО \"RusAUTO\"', 'RUsAUT@mail.ru', 'Воробушкин Р.В.', '11.02.2020', 2, 'Стальное_литье', 'Отбойники', 'Новый', '00.00.0000', '32000'),
(91, 'РАО \"ЕЭСРоссии\" ', 'EVru@mail.ru', 'Медведев В.П.', '14.06.2020', 70, 'Чугунное_литье', 'Отводы', 'Новый', '00.00.0000', '503000'),
(93, 'ГК \"Мегаполис\"', 'Nanorus@mail.ru', 'Басов В.Р.', '14.06.2020', 60, 'Стальное_литье', 'Отбойники', 'Новый', '00.00.0000', 'None'),
(94, 'ООО \"NanoRus\"', 'Nanorus@mail.ru', 'Басов В.Р.', '11.04.2019', 8, 'Художественное_литье', 'Скамейки', 'Выполнен', '18.04.2019', '17800'),
(96, 'ООО \"NanoRus\"', 'Nanorus@mail.ru', 'Басов В.Р.', '11.04.2019', 8, 'Художественное_литье', 'Скамейки', 'Выполнен', '18.04.2019', '17800'),
(97, 'ООО \"RusAUTO\"', 'RUsAUT@mail.ru', 'Воробушкин Р.В.', '11.03.2020', 2, 'Стальное_литье', 'Отбойники', 'Выполнен', '17.03.2020', '12000'),
(98, 'ООО \"RusAUTO\"', 'RUsAUT@mail.ru', 'Воробушкин Р.В.', '11.03.2020', 2, 'Стальное_литье', 'Отбойники', 'Выполнен', '17.03.2020', '12000'),
(99, 'ООО \"RusAUTO\"', 'RUsAUT@mail.ru', 'Воробушкин Р.В.', '11.03.2020', 2, 'Стальное_литье', 'Отбойники', 'Выполнен', '17.03.2020', '12000'),
(100, 'ООО \"RusAUTO\"', 'RUsAUT@mail.ru', 'Воробушкин Р.В.', '11.03.2020', 2, 'Стальное_литье', 'Отбойники', 'Выполнен', '17.03.2020', '12000'),
(101, 'ООО \"RusAUTO\"', 'RUsAUT@mail.ru', 'Воробушкин Р.В.', '11.03.2020', 2, 'Стальное_литье', 'Отбойники', 'Выполнен', '17.03.2020', '12000');

-- --------------------------------------------------------

--
-- Структура таблицы `table3`
--

CREATE TABLE `table3` (
  `Код` int(2) NOT NULL,
  `Чугунное_литье` varchar(21) DEFAULT NULL,
  `Стальное_литье` varchar(12) DEFAULT NULL,
  `Художественное_литье` varchar(10) DEFAULT NULL,
  `Серийные_изделия` varchar(45) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `table3`
--

INSERT INTO `table3` (`Код`, `Чугунное_литье`, `Стальное_литье`, `Художественное_литье`, `Серийные_изделия`) VALUES
(1, 'цилиндры', 'фланцы', 'балясины', 'Токарная (универсальное)'),
(2, 'поршня', ' импеллеры', 'лестницы', 'Токарная\r\n(крупное оборудование)'),
(3, 'втулки', 'детали печей', 'ограждения', 'Токарная с ЧПУ'),
(4, 'различного диаметра', 'колосники', 'люки', 'Фрезерная'),
(5, 'гильзы', 'решетки', 'фонтаны', 'Расточная'),
(6, 'кольца', 'било', 'фонари', 'Зуборезная'),
(7, 'шкивы', 'брони', 'скамейки', 'Круглошлифовальная\r\n(наружная, внутренняя'),
(8, 'крейцкопфы', 'отбойники', '', 'Дозировочные насосы'),
(9, 'колеса рабочие', 'скрепки', '', 'Электронасосные агрегаты одноплунжерных типов'),
(10, 'аппараты выправляющие', '', '', 'Чугунные_скамейки'),
(11, 'корпуса подшипников', '', '', 'Насосные_агрегаты'),
(12, 'отводы', '', '', 'Лючок_для_задвижек'),
(13, 'трубы', '', '', 'Чугунные_фонари'),
(14, 'блоки', '', '', 'Тигли'),
(15, 'колеса', '', '', 'Изложницы');

-- --------------------------------------------------------

--
-- Структура таблицы `table4`
--

CREATE TABLE `table4` (
  `id` int(10) UNSIGNED NOT NULL,
  `Название_организации` varchar(99) DEFAULT NULL,
  `Контактная_информация` varchar(50) DEFAULT NULL,
  `ФИО_заказчика` varchar(50) DEFAULT NULL,
  `Дата` varchar(50) DEFAULT NULL,
  `Количество` int(50) DEFAULT NULL,
  `Вид_литья` varchar(50) DEFAULT NULL,
  `Деталь` varchar(50) DEFAULT NULL,
  `Статус` varchar(50) DEFAULT NULL,
  `Дата_сдачи` varchar(50) DEFAULT NULL,
  `Цена` varchar(50) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `table4`
--

INSERT INTO `table4` (`id`, `Название_организации`, `Контактная_информация`, `ФИО_заказчика`, `Дата`, `Количество`, `Вид_литья`, `Деталь`, `Статус`, `Дата_сдачи`, `Цена`) VALUES
(1, 'ОАО \"GoldenFolt\"', 'GoldenF@yandex.ru', 'Мерсков Д.В.', '22.10.2018', 35, 'Стальное_литье', 'Детали печей', 'Выполнен', '28.10.20`8', '23000'),
(5, 'ОАО \"Сургутнефтегаз\"', 'RusRUNER@mail.ru', 'Маслов В.Е.', '06.11.2018', 6, 'Стальное_литье', 'Колосники', 'Выполнен', '11.11.2018', '34500'),
(20, 'ООО \"SoleFerma\"', 'Sol.SOl@mail.ru', 'Молчанов К.Н.', '06.11.2018', 1, 'Стальное_литье', 'Детали печей', 'Выполнен', '10.11.2018', '53000'),
(22, 'ООО \"RusAUTO\"', 'RUsAUT@mail.ru', 'Воробушкин Р.В.', '11.11.2018', 2, 'Стальное_литье', 'Отбойники', 'Выполнен', '14.11.2018', '23000'),
(23, 'ООО \"bikeAndVilosipeds\"', 'Vivosipedd@mail.ru', 'Волков Р.Р.', '19.01.2019', 5, 'Художественное_литье', 'Ограждения', 'Выполнен', '22.01.2019', '36000'),
(24, 'ОАО \"Сургутнефтегаз\"', 'Syrgyt@mail.ru', 'Маслов В.В.', '12.03.2019', 14, 'Художественное_литье', 'Фонари', 'Выполнен', '14.03.2019', '44500'),
(25, 'ОАО \"GoldenFolt\"', 'GoldenF@yandex.ru', 'Мерсков Д.В.', '12.03.2019', 21, 'Чугунное_литье', 'Вентильные колодцы', 'Выполнен', '16.03.2019', '60000'),
(26, 'ОАО \"CoteAndMahsa\"', 'ColeandMMM@mail.ru', 'Филинов П.С.', '12.03.2019', 12, 'Художественное_литье', 'Лестницы', 'Выполнен', '03.04.2019', '12999'),
(34, 'ИА \"МеталлЭксперт\"', 'MK@mail.ru', 'Никитов Н.Н.', '25.03.2019', 51, 'Художественное_литье', 'Люки', 'Отменен', '28.03.2019', '80000'),
(35, 'ООО \"NanoRus\"', 'Nanorus@mail.ru', 'Басов В.Р.', '11.04.2019', 8, 'Художественное_литье', 'Скамейки', 'Выполнен', '18.04.2019', '17800'),
(36, 'ОАО \"Сургутнефтегаз\"', 'Syrgryt@mail.ru', 'Маслов В.Е.', '12.04.2019', 3, 'Художественное_литье', 'Фонари', 'Выполнен', '16.04.2019', '15000'),
(37, 'ООО \"RusAUTO\"', 'RUsAUT@mail.ru', 'Воробушкин Р.В.', '05.05.2019', 20, 'Стальное_литье', 'Отбойники', 'Выполнен', '10.05.2019', '15900'),
(38, 'ООО \"NanoRus\"', 'Nanorus@mail.ru', 'Басов В.Р.', '11.05.2019', 12, 'Художественное_литье', 'Скамейки', 'Выполнен', '16.05.2019', '14000'),
(39, 'ООО \"SoleFerma\"', 'Sol.SOl@mail.ru', 'Молчанов К.Н.', '12.01.2019', 11, 'Стальное_литье', 'Детали печей', 'Выполнен', '21.01.2019', '13000'),
(40, 'ООО \"RusAUTO\"', 'RUsAUT@mail.ru', 'Воробушкин Р.В.', '11.03.2020', 2, 'Стальное_литье', 'Отбойники', 'Выполнен', '17.03.2020', '12000'),
(41, 'ГК \"Мегаполис\"', 'Megapolys@mail.ru', 'Маслов В.Е.', '01.04.2020', 20, 'Стальное_литье', 'Колосники', 'Выполнен', '09.04.2020', '30000'),
(55, 'ООО \"NanoRus\"', 'Nanorus@mail.ru', 'Басов В.Р.', '10.04.2020', 8, 'Чугунное_литье', 'Скамейки', 'Выполнен', '12.04.2020', '32000'),
(63, 'ООО \"RusAUTO\"', 'RUsAUT@mail.ru', 'Воробушкин Р.В.', '11.05.2020', 2, 'Стальное_литье', 'Отбойники', 'Выполнен', '13.05.2020', '20000'),
(73, 'ГК \"Мегаполис\"', 'Nanorus@mail.ru', 'Басов В.Р.', '26.04.2020', 50, 'Художественное_литье', 'Скамейки', 'Выполнен', '29.04.2020', '32000'),
(74, 'ООО \"RusAUTO\"', 'RUsAUT@mail.ru', 'Воробушкин Р.В.', '11.02.2020', 20, 'Стальное_литье', 'Отбойники', 'Выполнен', '12.02.2020', '32000'),
(75, 'ООО \"RusAUTO\"', 'RUsAUT@mail.ru', 'Воробушкин Р.В.', '11.02.2020', 26, 'Стальное_литье', 'Отбойники', 'Процесс', '13.02.2020', '32000'),
(87, 'РАО \"ЕЭСРоссии\" ', 'EVru@mail.ru', 'Медведев В.П.', '12.06.2020', 30, 'Художественное_литье', 'Люки', 'Выполнен', '14.06.2020', '53000'),
(90, 'РАО \"ЕЭСРоссии\" ', 'EVru@mail.ru', 'Медведев В.П.', '12.06.2020', 70, 'Чугунное_литье', 'Отводы', 'Выполнен', '15.02.2020', '503000'),
(92, 'ГК \"Мегаполис\"', 'Nanorus@mail.ru', 'Басов В.Р.', '12.06.2020', 60, 'Стальное_литье', 'Отбойники', 'Выполнен', '15.06.2020', '425000'),
(102, 'ГК \"Мегаполис\"', 'Nanorus@mail.ru', 'Басов В.Р.', '13.06.2020', 70, 'Чугунное_литье', 'Трубы', 'Выполнен', '16.06.2020', '270000'),
(105, 'ИА \"МеталлЭксперт\"', 'MK@mail.ru', 'Никитов Н.Н.', '13.06.2020', 51, 'Чугунное_литье', 'Различного диаметра', 'Выполнен', '14.06.2020', '235000'),
(106, 'ИА \"МеталлЭксперт\"', 'MK@mail.ru', 'Никитов Н.Н.', '13.06.2020', 37, 'Чугунное_литье', 'Аппараты выправляющие', 'Выполнен', '00.00.0000', 'None'),
(107, 'ИА \"МеталлЭксперт\"', 'MK@mail.ru', 'Никитов Н.Н.', '14.06.2020', 63, 'Стальное_литье', 'Импеллеры', 'Выполнен', '16.06.2020', '260000'),
(108, 'ОАО \"CoteAndMahsa\"', 'ColeandMMM@mail.ru', 'Филинов П.С.', '14.06.2020', 42, 'Художественное_литье', 'Фонтаны', 'Выполнен', '15.06.2020', '45300'),
(109, 'ГК \"Мегаполис\"', 'Megapolys@mail.ru', 'Маслов В.Е.', '14.06.2020', 49, 'Стальное_литье', 'Шкивы', 'Выполнен', '15.06.2020', '253000'),
(110, 'ГК \"Мегаполис\"', 'Megapolys@mail.ru', 'Маслов В.Е.', '15.06.2020', 40, 'Стальное_литье', 'Колосники', 'Выполнен', '18.06.2020', '60000'),
(111, 'ИА \"МеталлЭксперт\"', 'MK@mail.ru', 'Никитов Н.Н.', '14.06.2020', 55, 'Художественное_литье', 'Фонари', 'Отменен', '00.00.0000', '700000'),
(112, 'ИА \"МеталлЭксперт\"', 'MK@mail.ru', 'Никитов Н.Н.', '14.06.2020', 70, 'Художественное_литье', 'Фонари', 'Выполнен', '16.06.2020', '450000'),
(113, 'ИА \"МеталлЭксперт\"', 'MK@mail.ru', 'Никитов Н.Н.', '14.06.2020', 20, 'Серийные_изделия', 'Зуборезная', 'Новый', '00.00.0000', '450000'),
(114, 'ИА \"МеталлЭксперт\"', 'MK@mail.ru', 'Никитов Н.Н.', '14.06.2020', 63, 'Серийные_изделия', 'Чугунные_скамейки', 'Выполнен', '16.06.2020', '420000'),
(115, 'ООО \"NanoRus\"', 'Nanorus@mail.ru', 'Басов В.Р.', '14.06.2020', 35, 'Стальное_литье', 'Фланцы', 'Новый', '00.00.0000', 'None'),
(116, 'ГК \"Мегаполис\"', 'Nanorus@mail.ru', 'Басов В.Р.', '15.06.2020', 25, 'Чугунное_литье', 'Кольца', 'Новый', '00.00.0000', '53700'),
(117, 'ОАО \"GoldenFolt\"', 'GoldenF@yandex.ru', 'Мерсков Д.В.', '15.06.2020', 35, 'Стальное_литье', 'Детали печей', 'Новый', '28.10.20`8', '23000'),
(118, 'ОАО \"GoldenFolt\"', 'GoldenF@yandex.ru', 'Мерсков Д.В.', '15.06.2020', 35, 'Стальное_литье', 'Детали печей', 'Новый', '22.11.2040', '1000000'),
(121, 'ОАО \"GoldenFolt\"', 'GoldenF@yandex.ru', 'Мерсков Д.В.', '15.06.2020', 35, 'Стальное_литье', 'Детали печей', 'Новый', '22.11.2066', '1000000');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `table1`
--
ALTER TABLE `table1`
  ADD PRIMARY KEY (`Код`);

--
-- Индексы таблицы `table2`
--
ALTER TABLE `table2`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `table3`
--
ALTER TABLE `table3`
  ADD PRIMARY KEY (`Код`);

--
-- Индексы таблицы `table4`
--
ALTER TABLE `table4`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `table1`
--
ALTER TABLE `table1`
  MODIFY `Код` int(2) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=85;

--
-- AUTO_INCREMENT для таблицы `table4`
--
ALTER TABLE `table4`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=122;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
